run/icoPhaseChangeVoF/LPBFsmall/0/divU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      divU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ymax
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    xmin
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    xmax
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    ymin
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    zmin
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
    zmax
    {
        type            extrapolatedCalculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
