run/icoPhaseChangeVoF/LPBFsmall/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson
    ocCoeff
    {
        type scale;
        scale linearRamp;
        duration 1e-8;
        value 0.0;
    };
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited<cubic> 1.5 Gauss linear 1;
}

divSchemes
{
    default         none;

    //div(phi,alpha)  Gauss interfaceCompression vanLeer 1;
    div(phi,alpha)      Gauss MPLIC;

    div(alphaPhi,alpha) Gauss upwind;

    scheme  Gauss linearUpwind limited;
    div(rhoPhi,U)           $scheme;
    div(rhoPhiCp,T)         $scheme;
    div(alphaRhoPhi,solid)  $scheme;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    // Only for compressibleVoF
    div(rhoPhi,K)       $scheme;
    div(phi,p)          $scheme;
    div(alphaRhoPhi,h)  $scheme;
    div(alphaRhoPhi,T)  $scheme;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //