run/icoPhaseChangeVoF/LPBFsmall/system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coordinates
{
    type        global;

    e1          (1 0 0);
    e2          (0 1 0);
    e3          (0 0 1);

    directions  (e1 e2 e3);
}

zones
{
    powderBed
    {
        type    spheres;
        data
        (
            #include "powderBed"
        );
        offset      (0 0 100e-6);
        scale       1.4;
    }
}

useHexTopology  true;

geometricCut    false;

// ************************************************************************* //
